# 1.Відтвори ASCII таблицю у вигляді словника, обов'язкові умови:
#       - Використай генератор словника
#       - Використай вбудовану функцію chr()

# 2.Реалізувати послідовність операцій яка
#       - Приймає від користувача строку тільки з літер, без пробілів
#       - Приймає від користувача пароль у вигляді цілого числа
#       - Створює словник шифра метода одноалфавітної підстановки на базі пароля. Тобто пароль - число 
#                на яке треба збільшити порядковий номер літери у алфавіті
#       - Шифрує строку на базі словника шифра. Приклад
#               + Звичайний порядок "a" - 1, "b" - 2, ..., "z" - 26 -> словник "a"="a", "b"="b", ..., "z"="z"
#               + З паролем у 4 порядок стає "a" - 5, "b" - 6, ..., "z" - 4 -> словник "a"="e", "b"="f", ..., "z"="d"
#               + Рядок "hello" перетворюється на "lipps"
#       - Друкує зашифровану строку
