# 1.Створити послідовність інструкцій, яка друкує результат аналізу 2 наборів текстових даних з будь-яких символів,
#   отриманих від користувача
#       - Список літер, які присутні в обох наборах, регістр має значення ("A" та "a" - окремі літери). Літери не повторювати
#       - Список цифр, які є в першому або в другому наборі, але не в обох. Цифри не повторювати

# 2.Знайди та ознайомся з операторами |=, &=, -=, ^=, та методами які відповідають цим операторам. Наведи по 
#   1 прикладу для кожного оператора, використовуй 3 множини одночасно у якості операндів 