# Створи файл lists_and_tuples.py у своєму проекті, виконуй завдання в ньому, використовуй англійську
# Після виконання практичної роботи - запуш її у GitHub

# 1.Створи послідовність інструкцій, яка отримує рядок від користувача та друкує кожне третє 
#       слово з цього рядка. Цикли не використовувати

user_input = input("Write her your sentence: ")
print(user_input.split()[2::3])

# 2.Створи генератор списка
#   - Вхідний список [1, 2.1, "f", "2", 3, "1", 18, "df"]
#   - Вихідний список [1, 2.1, -1, '6', 9, '3', 18, -1]
#   - Як та які елементи потрапляють з вхідного до вихідного списка:
#       1.Елемент типу float
#       2.Елемент типу int та є парним
#       3.Елемент типу int та є непарним. Додатково звести у 2 ступінь. Приклад, елемент 3 -> 9
#       4.Елемент типу str у якому лише цифри. Додатково помножити на 3. Приклад, елемент "2" -> "6"
#       5.В інших випадках замість елемента підстав число -1

input_list = [1, 2.1, "f", "2", 3, "1", 18, "df"]

output_list = [
    i if isinstance(i, float) else
    i ** 2 if isinstance(i, int) and i % 2 != 0 else
    i if isinstance(i, int) and i % 2 == 0 else
    str(int(i) * 3) if i.isdigit() else -1
    for i in input_list
]

print(output_list)